In [1]:
import pandas as pd

In [5]:
# 절대경로
# pd.read_csv('C:\Users\iamyo\PycharmProjects\pythonProject1\220321\train.csv')
# 상대경로
titan_df = pd.read_csv('train.csv')
titan_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [6]:
titan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
titan_df.shape

(891, 12)

In [8]:
titan_df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [9]:
titan_df[['Sex']]

        Sex
0      male
1    female
2    female
3    female
4      male
..      ...
886    male
887  female
888  female
889    male
890    male

[891 rows x 1 columns]

In [10]:
titan_df.describe()

titan_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [11]:
# 컬럼을 바꿀때 쓰는 방법-1
titan_df=titan_df.rename(columns={'Sex':'Gender'})

# 컬럼을 바꿀때 쓰는 방법-2
titan_df.rename(columns={'Sex':'Gender'}, inplace=True) # inplace = True 라면 원본을 바꿈
titan_df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [12]:
## pandas 새로운 컬럼 추가
titan_df['Age_0'] = 0
titan_df.head(4)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0

In [14]:
# 섭동 (Perturbation)
titan_df['Age_by_10']=titan_df['Age']*10
titan_df['Age by 10']=titan_df['Age']*10

In [15]:
# Fam_no :: 파생변수
titan_df['Fam_no'] = titan_df.SibSp +  titan_df.Parch + 1

In [16]:
# 위의 저희가 생성했던 columns를 삭제해보기...
# 단, 열 기준으로도 // 행 기준으로~!

titan_df1 = titan_df.drop('Age by 10', axis=1) # axis = 0 이라면, 행
                                            # axis = 1 이라면, 열

In [17]:
# # 열들을 지우는 방법 -1 re-assign
# titan_df1 = titan_df1.drop(['Age_0','Age_by_10','Fam_no'], axis=1)

# 열들을 지우는 방법 -2 parameter inplace = True
titan_df1.drop(['Age_0','Age_by_10','Fam_no'], axis=1, inplace=True)

titan_df1

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)

print('### before axis 0 ###')
print(titan_df.head())

titan_df.drop([0,2,4], axis=0, inplace=True)

### before axis 0 ###
   PassengerId  Survived  Pclass            Name  Gender   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Age by 10  Fam_no
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      220.0      220.0       2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      380.0      380.0       2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      260.0      260.0       1
3            4         1       1  Futrelle, M...  female  35.0      1      0          113803  53.1000  C123        S      0      350.0      350.0       2
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450   8.0500   NaN        S      0      350.0      350.0       1

In [ ]:
### Axis=0, Axis=1 비교 :: via numpy

# df -> list, dictionary, numpy ndarray inter-translate

In [23]:
import numpy as np
import pandas as pd

In [28]:
col_name1 = ['col1']
l1 = [1,2,3]
a1 = np.array(11)

# list 활용하여 df 생성
df_l1 = pd.DataFrame(l1, columns=col_name1)
print('DF generated as 1Dim list:\n',df_l1)

DF generated as 1Dim list:
    col1
0     1
1     2
2     3